In [7]:
import pandas as pd

df=pd.DataFrame({
    'city':['New York','London','Paris','Tokyo','New York','Paris'],
    'price':[100,399,244,199,609,788]
})

In [8]:
df

       city  price
0  New York    100
1    London    399
2     Paris    244
3     Tokyo    199
4  New York    609
5     Paris    788

In [9]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [10]:
mean_price

{'London': 399.0, 'New York': 354.5, 'Paris': 516.0, 'Tokyo': 199.0}

In [11]:
df['city_encoded']=df['city'].map(mean_price)

In [12]:
df

       city  price  city_encoded
0  New York    100         354.5
1    London    399         399.0
2     Paris    244         516.0
3     Tokyo    199         199.0
4  New York    609         354.5
5     Paris    788         516.0

In [13]:
df[['price','city_encoded']]

   price  city_encoded
0    100         354.5
1    399         399.0
2    244         516.0
3    199         199.0
4    609         354.5
5    788         516.0